moag1000/ESP32-c5-Zigbee2ESPHome/sdkconfig.defaults
# ESP32-C5 Zigbee2MQTT Gateway - Default SDK Configuration
# This file contains default configuration values for the project

#
# Target Configuration
#
CONFIG_IDF_TARGET="esp32c5"
CONFIG_IDF_TARGET_ESP32C5=y

#
# Serial flasher config
#
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

#
# Partition Table
#
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

#
# CPU Frequency (generic in ESP-IDF v6.0)
#
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

#
# PSRAM Configuration (8MB PSRAM available)
# Large buffers explicitly allocated to PSRAM via heap_caps_malloc():
#   - Zigbee device registry (~11KB)
#   - Zigbee reporting/binding/interview/groups/scenes (~15KB)
#   - BLE device registry (~7.5KB)
#   - OTA upload buffer (512KB)
#
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
# Allocations <=256 bytes go to internal RAM, larger ones try PSRAM first
# Keeps small timing-critical buffers (Zigbee ZCL frames, WiFi management
# frames) in fast internal SRAM for reliable radio operation
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=256
# Reserve 32KB internal heap for DMA-capable and cache-disabled operations
# BLE controller (~20-30KB) + WiFi DMA + Zigbee stack need internal RAM
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

#
# PSRAM Usage for WiFi/LWIP/mbedTLS - CRITICAL for memory savings
# Without these, WiFi and TLS use ~80KB+ of internal RAM
#
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Move BSS segments of lwIP, net80211, libpp, wpa_supplicant, bluedroid to PSRAM
# This is the single biggest internal RAM saver (~20-40KB freed)
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y

# Execute code and read constants directly from PSRAM (XIP = eXecute In Place)
# Frees flash cache lines and reduces internal RAM pressure (~10-50KB savings)
# Requires SPIRAM_SPEED_80M (already enabled above)
CONFIG_SPIRAM_XIP_FROM_PSRAM=y

#
# FreeRTOS
#
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS=y
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
# Timer task - software timer callbacks (state save, interview timeouts) are lightweight
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=2048

#
# Log output
#
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y
CONFIG_LOG_COLORS=y
CONFIG_LOG_TIMESTAMP_SOURCE_RTOS=y

#
# WiFi - Optimized for ESP32-C5 WiFi 6 (802.11ax)
# Static buffers = internal RAM (DMA required)
# Note: Dynamic TX buffers unavailable when SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
#
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=4
# Dynamic RX reduced to 16 - sufficient for MQTT gateway traffic
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
# Static TX reduced from 16→6 to save ~16KB internal RAM for BLE controller
# 6 TX buffers is sufficient for MQTT gateway (small, infrequent packets)
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=6
CONFIG_ESP_WIFI_CACHE_TX_BUFFER_NUM=8
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP_WIFI_NVS_ENABLED=y

# WiFi 6 AMPDU Block Ack Window - reduced to match static RX buffer (max 2x)
CONFIG_ESP_WIFI_TX_BA_WIN=8
CONFIG_ESP_WIFI_RX_BA_WIN=8

# WiFi 6 (802.11ax) - auto-enabled via SOC_WIFI_HE_SUPPORT in v6.0

# WPA3 Security - DISABLED to prevent SA Query timeout issues
# SA Query requires fast management frame responses (~100-200ms)
# which conflict with tri-radio coexistence on ESP32-C5
# The ESP32 may miss the SA Query timeout when Zigbee/BLE is active
CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=n
CONFIG_ESP_WIFI_ENABLE_SAE_PK=n
CONFIG_ESP_WIFI_ENABLE_WPA3_OWE_STA=n
CONFIG_ESP_WIFI_SOFTAP_SAE_SUPPORT=n

# GCMP Encryption disabled - WPA3 is off, CCMP is sufficient for WPA2
# Saves ~2-3KB internal RAM
CONFIG_ESP_WIFI_GCMP_SUPPORT=n
CONFIG_ESP_WIFI_GMAC_SUPPORT=n

# Application-level WiFi settings
CONFIG_WIFI_PREFER_5GHZ=y
CONFIG_WIFI_5GHZ_RSSI_ADJUSTMENT=25
CONFIG_WIFI_AUTO_BAND_SWITCH=y
# Force 5GHz-only mode to completely avoid 2.4GHz/Zigbee interference
# Set to y if your router supports 5GHz and has stable signal
CONFIG_WIFI_5GHZ_ONLY=n
# Disable Protected Management Frames (PMF) to avoid SA Query timeout
# PMF is part of WPA3 but can be used with WPA2 - causes issues with tri-radio
CONFIG_WIFI_DISABLE_PMF=y

# Captive Portal - start AP for WiFi config if connection fails
CONFIG_WIFI_CAPTIVE_PORTAL_ENABLE=y
CONFIG_WIFI_CAPTIVE_PORTAL_TIMEOUT_SEC=300

# Power management
CONFIG_ESP_WIFI_STA_DISCONNECTED_PM_ENABLE=y

# Fast Roaming (802.11k/v/r) disabled - stationary gateway with single AP (~3-5KB)
# Re-enable if deploying in multi-AP mesh environments
CONFIG_ESP_WIFI_11KV_SUPPORT=n
CONFIG_ESP_WIFI_11R_SUPPORT=n
CONFIG_ESP_WIFI_SCAN_CACHE=n
CONFIG_ESP_WIFI_MBO_SUPPORT=n

# WiFi Power Management
CONFIG_ESP_WIFI_SLP_DEFAULT_MIN_ACTIVE_TIME=50
CONFIG_ESP_WIFI_SLP_DEFAULT_MAX_ACTIVE_TIME=10
# FTM (indoor positioning) disabled - stationary gateway, not needed (~2-4KB)
CONFIG_ESP_WIFI_FTM_ENABLE=n

# BSS Max Idle disabled - no code references, not needed (~0.5KB)
CONFIG_ESP_WIFI_BSS_MAX_IDLE_SUPPORT=n

# Enterprise WiFi (EAP/RADIUS) disabled - home gateway uses WPA2-PSK (~3-5KB)
CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT=n

# Disable WiFi IRAM/RX IRAM opts to save internal RAM (sacrifices some performance)
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n

#
# LWIP TCP/IP Stack - Optimized for IoT gateway (buffers in PSRAM)
#
CONFIG_LWIP_MAX_SOCKETS=8
CONFIG_LWIP_SO_REUSE=y
CONFIG_LWIP_SO_RCVBUF=y

# TCP Performance - buffers allocated from PSRAM (SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y)
# 16KB absorbs burst publishes + TCP retransmission during WiFi/Zigbee coexistence
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=16384
CONFIG_LWIP_TCP_WND_DEFAULT=16384
CONFIG_LWIP_TCP_RECVMBOX_SIZE=16
CONFIG_LWIP_UDP_RECVMBOX_SIZE=16

# TCP Selective ACK (SACK) - improves recovery from packet loss
CONFIG_LWIP_TCP_SACK_OUT=y

# MSS optimization
CONFIG_LWIP_TCP_MSS=1440

# High-speed TCP retransmission
CONFIG_LWIP_TCP_HIGH_SPEED_RETRANSMISSION=y

# IP fragmentation disabled - MQTT/Zigbee packets fit within MTU (~1-2KB)
CONFIG_LWIP_IP4_REASSEMBLY=n
CONFIG_LWIP_IP6_REASSEMBLY=n
CONFIG_LWIP_IP4_FRAG=n
CONFIG_LWIP_IP6_FRAG=n

# DNS
CONFIG_LWIP_DNS_MAX_SERVERS=3

#
# MQTT Configuration
#
CONFIG_MQTT_PROTOCOL_311=y
CONFIG_MQTT_TRANSPORT_SSL=y
# WebSocket transport disabled - standard MQTT/MQTTS is used (~3-5KB)
CONFIG_MQTT_TRANSPORT_WEBSOCKET=n
CONFIG_MQTT_TRANSPORT_WEBSOCKET_SECURE=n
# Custom MQTT task config - 4KB sufficient, JSON uses buffer pools not stack
CONFIG_MQTT_USE_CUSTOM_CONFIG=y
CONFIG_MQTT_TASK_STACK_SIZE=4096

#
# mbedTLS - Use PSRAM for TLS buffers (saves ~20-30KB internal RAM)
#
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
# Use common CAs only instead of full bundle - saves ~25KB flash
# Covers 99%+ of real-world MQTT brokers (Let's Encrypt, DigiCert, etc.)
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_CMN=y
# ChaCha20-Poly1305 for Noise Protocol (REQUIRED for ESPHome API)
# TF-PSA-Crypto in ESP-IDF v6.0 has a bug: POLY1305_C wasn't migrated to PSA.
# esp_config.h patched to NOT define legacy MBEDTLS_POLY1305_C (rejected by TF-PSA).
# config_adjust_legacy_from_psa.h auto-defines it from PSA_WANT_ALG_CHACHA20_POLY1305.
CONFIG_MBEDTLS_CHACHA20_C=y
CONFIG_MBEDTLS_POLY1305_C=y
CONFIG_MBEDTLS_CHACHAPOLY_C=y
# Use external PSRAM for mbedTLS allocations
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_SSL_VARIABLE_BUFFER_LENGTH=y
# Hardware acceleration for crypto (ESP32-C5 specific)
CONFIG_MBEDTLS_HARDWARE_SHA=y
CONFIG_MBEDTLS_HARDWARE_AES=y

# PSA Crypto API is the default in v6.0 — no explicit config needed

#
# ESPHome API - Noise Encryption
#
CONFIG_ESPHOME_NOISE_ENCRYPTION=y
CONFIG_ESPHOME_NOISE_PSK="REDACTED-NOISE-PSK"
CONFIG_ESPHOME_ALLOW_PLAINTEXT=n
CONFIG_ESPHOME_NOISE_REQUIRE_PSK=y

#
# Bluetooth / NimBLE Configuration
# DISABLED: ESP32-C5 cannot maintain stable GATT connections for BLE proxy.
# Disabling BLE frees ~30KB internal RAM for Zigbee+WiFi stability.
#
CONFIG_BT_ENABLED=n
CONFIG_BT_SCANNER_ENABLED=n

#
# WiFi/Zigbee Coexistence
# ESP32-C5 shares a single radio for WiFi/Zigbee - coexistence arbitrates access
#
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y
# CRITICAL: Disable coex power management - causes WiFi starvation and MQTT timeouts
CONFIG_ESP_COEX_POWER_MANAGEMENT=n

#
# Zigbee Configuration
# Channel 15 - widely scanned by all Zigbee devices including older Aqara
#
CONFIG_ZB_ENABLED=y
CONFIG_ZB_RADIO_NATIVE=y
CONFIG_ZB_ZCZR=y
CONFIG_ZIGBEE_CHANNEL=15

#
# NVS
#
CONFIG_NVS_ENCRYPTION=n

#
# Watchdog Timers
#
CONFIG_ESP_TASK_WDT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
CONFIG_ESP_INT_WDT=y
CONFIG_ESP_INT_WDT_TIMEOUT_MS=300

#
# Main task - reduced from 6144, app_main() is lightweight init-only
#
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096

#
# System - event task reduced to 4KB, event handlers are lightweight
#
CONFIG_ESP_SYSTEM_EVENT_QUEUE_SIZE=32
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

#
# Compiler options
#
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_ENABLE=y

#
# State Persistence
#
CONFIG_STATE_PERSISTENCE_ENABLE=y
CONFIG_STATE_PERSISTENCE_INTERVAL_SEC=300

#
# mmWave Presence Sensor (HMMD S3KM1110)
#
CONFIG_MMWAVE_SENSOR_ENABLE=y
CONFIG_MMWAVE_GPIO_TX=5
CONFIG_MMWAVE_GPIO_RX=4
